#+TITLE: Clase 02 - Procesos
#+STARTUP: inlineimages
* Ejemplos en codigo
  #+BEGIN_SRC C :results output
    #include <stdio.h>

    int main(char *varg, int carg){
      int pid;
      char *programa[] = {"ps", "f", NULL};
      pid = fork();

      if(pid <0){
        printf("hubo un error con el fork\n");
        return -1;
      }
      if(pid == 0){
        // codigo proceso hijo
        // al comando /bin/ps le paso el comando "ps" con el parámetro "f"
        execv("/bin/ps", programa);
      }
      if(pid >0){
        // codigo proceso padre
        wait(NULL);
        printf("proceso hijo finalizado\n");
      }
    }
  #+END_SRC

  #+RESULTS:
  : PID TTY      STAT   TIME COMMAND
  :    1549 pts/1    Ss+    0:00 /bin/bash
  : proceso hijo finalizado

